/* Tool tip for the continue execution button */
"continueButtonToolTip" = "继续执行";

/* Tool tip for the step into instruction button */
"stepIntoSegmentToolTip" = "步入指令";

/* Tool tip for the step over instruction button */
"stepOverSegmentToolTip" = "步过指令";

/* Tool tip for the step out of function button */
"stepOutSegmentToolTip" = "从当前函数步出";

/* Labels 'Go to Call Address' menu item in Debug menu when using debugger, when a 'call' type instruction is selected */
"goToCallAddress" = "跳转到调用地址";

/* Labels 'Go to Branch Address' menu item in Debug menu when using debugger, when a 'jmp' type instruction is selected */
"goToBranchAddress" = "跳转到分支地址";

/* Labels 'Add Breakpoint' menu item in Debug menu when using debugger, when selected instruction does not have a breakpoint attached to it; also used for undo'ing an add breakpoint change in Edit menu */
"addBreakpoint" = "添加断点";

/* Labels 'Add Breakpoints' menu item in Debug menu when using debugger, when selected instruction does not have a breakpoint attached to it; also used for undo'ing an add breakpoints change in Edit menu */
"addBreakpoints" = "添加断点";

/* Labels 'Add Hardware Breakpoint' menu item in Debug menu when using debugger, when selected instruction does not have a breakpoint attached to it */
"addHardwareBreakpoint" = "添加硬件断点";

/* Labels 'Add Hardware Breakpoints' menu item in Debug menu when using debugger, when selected instruction does not have a breakpoint attached to it */
"addHardwareBreakpoints" = "添加硬件断点";

/* Labels 'Remove Breakpoint' menu item in Debug menu when using debugger, when selected instruction does have a breakpoint attached to it; also used for undo'ing an remove breakpoint change in Edit menu */
"removeBreakpoint" = "移除断点";

/* Labels 'Remove Breakpoints' menu item in Debug menu when using debugger, when selected instruction does have a breakpoint attached to it; also used for undo'ing an remove breakpoints change in Edit menu */
"removeBreakpoints" = "移除断点";

/* Labels 'NOP Instruction' menu item in Debug menu when using debugger */
"nopInstruction" = "NOP 指令";

/* Labels 'NOP Instructions' menu item in Debug menu when using debugger */
"nopInstructions" = "NOP 指令";

/* Tooltip Label when mouse hovering over an instruction that has a breakpoint condition configured */
"breakpointConditionTooltipLabel" = "断点条件";

/* Tooltip Label for letting user know debugging intel code in Rosetta process is unsupported when mouse hovering over an instruction breakpoint column */
"breakpointIntelRosettaUnsupportedTooltipLabel" = "不支持调试 Rosetta 目标进程中的 Intel 代码，但支持调试 ARM 代码。";

/* Alert title that shows up when failing to alter an instruction's assembly */
"failedModifyInstructionAlertTitle" = "修改指令失败";

/* Alert message that shows up when failing to alter an instruction's assembly */
"failedModifyInstructionAlertMessage" = "尝试汇编时出错";

/* Alert title that shows up when failing to overwrite an instruction */
"failedOverwriteInstructionsAlertTitle" = "覆盖指令失败";

/* Alert message that shows up when failing to overwrite an instruction */
"failedOverwriteInstructionsAlertMessage" = "此修改超出了所显示指令的边界。";

/* Alert title that shows up when changing an instruction may require altering more than one instruction */
"overwriteConfirmationAlertTitle" = "覆盖指令";

/* Alert message that shows up when changing an instruction may require altering more than one instruction */
"overwriteConfirmationAlertMessageFormat" = "此修改将覆盖 %ld 条指令。您确定要覆盖它们吗？";

/* Alert button that shows up when changing an instruction may require altering more than one instruction */
"overwrite" = "覆盖";

/* Undo action for changing an instruction */
"undoInstructionChange" = "更改指令";

/* Undo action for nopping an instruction */
"undoNOPChange" = "NOP 化指令";

/* Alert title that shows up when adding a breakpoint fails */
"failedAddBreakpointAlertTitle" = "添加断点失败";

/* Alert message that shows up when adding a breakpoint fails */
"failedAddBreakpointAlertMessage" = "无法添加断点。";

/* Undo action for moving the instruction pointer */
"undoMoveInstructionPointer" = "跳转";

/* Notification title for when a breakpoint is hit */
"hitBreakpointNotificationTitle" = "命中断点";

/* Notification message for when a breakpoint is hit */
"hitBreakpointNotificationMessage" = "已在断点处停止";

/* Alert title for failing to change a breakpoint condition */
"failedChangeBreakpointConditionAlertTitle" = "无效的断点表达式";

/* Alert message format for failing to change a breakpoint condition */
"failedChangeBreakpointConditionAlertMessageFormat" = "尝试解析表达式 「%@」 时出错";

/* Alert title for when a breakpoint condition fails to execute */
"failedExecuteBreakpointConditionAlertTitle" = "条件求值错误";

/* Alert message for when a breakpoint condition fails to execute */
"failedExecuteBreakpointConditionAlertMessage" = "「%@」 求值失败，原因如下：%@。详细信息请查看「调试」菜单下的「日志」。";

/* Alert title for failing to step over an instruction */
"failedStepOverAlertTitle" = "步过失败";

/* Alert message for failing to step over an instruction */
"failedStepOverAlertMessage" = "步过指令失败。";

/* Alert title for failing to step out */
"failedStepOutAlertTitle" = "步出失败";

/* Alert message for failing to step out */
"failedStepOutAlertMessage" = "步出过程失败。";

/* Error indicating yasm assembler failed to launch */
"failedLaunchYasm" = "yasm 任务启动失败";

/* Error indicating yasm did not assemble anything */
"failedAssembleWithZeroBytes" = "未汇编任何内容 (0 字节)。";

/* Error indicating yasm task could not be started */
"failedAssembleWithBadFileDescriptor" = "无法在 %s 上打开文件描述符。";

/* Error indicating keystone engine could not be started (unlikely to occur) */
"failedAssembleWithStartingEngine" = "汇编引擎启动失败，错误代码 %u。";

/* Error indicating keystone engine could not assemble code */
"failedAssembleCode" = "生成代码失败，错误代码 %u。";

/* Error indicating current instructions could not be NOP'ed for code injection */
"failedNOPInstructionsForInjectingCode" = "无法对当前指令执行 NOP";

/* Error indicating code injection for rosetta is not supported */
"failedInjectCodeForRosetta" = "不支持对 Rosetta 目标进程注入代码";

/* Alert Title for failing to allocate memory for code injection */
"failedAllocateMemoryForInjectingCodeAlertTitle" = "分配内存失败";

/* Alert Message for failing to allocate memory for code injection */
"failedAllocateMemoryForInjectingCodeAlertMessage" = "尝试向目标进程分配新内存时出错";

/* Alert Title for failing to inject code at the destination. Used in two places in code. */
"failedInjectCodeAlertTitle" = "注入代码失败";

/* Alert Message for failing to inject code at the destination */
"failedInjectCodeAlertMessage" = "没有足够的空间覆盖此指令，或新分配的地址距离过远";

/* Message indicating where the new code will be inserted into */
"newlyCodeInjectedAtMessage" = "; 新代码将写入 0x%llX\n";

/* Message for assembling code failing when attemping to inject code. */
"failedAssemblingForInjectingCodeMessage" = "汇编新代码时出错";

/* Error indicating memory protection could not be changed for newly injected instructions */
"failedChangeMemoryProtectionForInjectingCode" = "无法更改新指令的内存保护";
